# PlumbingUtils Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
PlumbingUtils Class
Members See Also
---
General utility methods in the Autodesk Revit MEP product.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static class PlumbingUtils
```

Visual Basic
---
```text
Public NotInheritable Class PlumbingUtils
```

Visual C++
---
```text
public ref class PlumbingUtils abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Plumbing..::..PlumbingUtils
# See Also
PlumbingUtils Members
Autodesk.Revit.DB.Plumbing Namespace